<img align="center" width="500" height="500" src="https://cdn.analyticsvidhya.com/wp-content/uploads/2020/07/panda-tips.jpg">

# 1. Giới thiệu về thư viện pandas

Thư viện là một package được xây dựng dựa trên numpy giúp chúng có thể xử lý dataframe dạng bảng gồm nhiều thuộc tính được gán nhãn.

In [1]:
import pandas as pd
pd.__version__

'1.1.5'

# 2. Tạo dữ liệu Series trong pandas

## `pd.Series()`

In [2]:
data=pd.Series([1,2,3,4,5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

Ta thấy rằng Series là kiểu mảng 1 chiều và được đánh index cho dữ liệu.

**Xem kiểu của dữ liệu**

In [3]:
type(data)

pandas.core.series.Series

Ở đây dữ liệu thuộc kiểu series.

**Giá trị của dữ liệu là 1 mảng array**

In [4]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

**Lấy index và subset của dữ liệu**

In [5]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
data[1]

2

In [7]:
data[0:3]

0    1
1    2
2    3
dtype: int64

**Tự tạo index**

In [8]:
data=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
data['c']

3

**Tạo dữ liệu dựa vào dictionary**

In [10]:
car_dict={"Audi":1994,"Tesla":2010,"Toyota":2012}
car=pd.Series(car_dict)
car

Audi      1994
Tesla     2010
Toyota    2012
dtype: int64

Các key của dict khi bỏ vào dữ liệu series sẽ đóng vai trò là index

In [11]:
car['Audi']

1994

In [12]:
car['Audi':'Tesla']

Audi     1994
Tesla    2010
dtype: int64

**Mảng 2 chiều với DataFrame**

In [13]:
car_dict={"Audi":1994,"Tesla":2010,"Toyota":2012}
car=pd.Series(car_dict)
car

Audi      1994
Tesla     2010
Toyota    2012
dtype: int64

In [14]:
df_car=pd.DataFrame({"year":car})
df_car

        year
Audi    1994
Tesla   2010
Toyota  2012

Tương tự như kiểu Series thì DataFrame sẽ có 2 chỉ số hàng và cột.

In [15]:
df_car.index

Index(['Audi', 'Tesla', 'Toyota'], dtype='object')

In [16]:
df_car.columns

Index(['year'], dtype='object')

In [17]:
df_car['year']

Audi      1994
Tesla     2010
Toyota    2012
Name: year, dtype: int64

In [18]:
pd.DataFrame(df_car,columns=['year'])

        year
Audi    1994
Tesla   2010
Toyota  2012

**Tạo dữ liệu DataFrame phối hợp dict với list**

In [19]:
a_dict={'a':1,'b':2}
b_dict={'b':3,'c':4}
pd.DataFrame([a_dict,b_dict])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

**Tạo dữ liệu đầy đủ**

In [20]:
import numpy as np
df=pd.DataFrame(np.random.rand(3, 2),
             columns=['height', 'long'],
             index=['a', 'b', 'c'])
df

     height      long
a  0.376248  0.135409
b  0.479127  0.965552
c  0.025883  0.619999

In [21]:
'height' in df

True

In [22]:
'c' in df

False

**Phương thức `key()` và `items()` trong python lõi**

In [23]:
df.keys()

Index(['height', 'long'], dtype='object')

In [24]:
list(df.items())

[('height', a    0.376248
  b    0.479127
  c    0.025883
  Name: height, dtype: float64), ('long', a    0.135409
  b    0.965552
  c    0.619999
  Name: long, dtype: float64)]

**Thêm một cột cho dữ liệu**

In [25]:
df['d']=2
df

     height      long  d
a  0.376248  0.135409  2
b  0.479127  0.965552  2
c  0.025883  0.619999  2

**Lấy tập con theo chiều index**

In [26]:
df['a':'b']

     height      long  d
a  0.376248  0.135409  2
b  0.479127  0.965552  2

In [27]:
df[0:2]

     height      long  d
a  0.376248  0.135409  2
b  0.479127  0.965552  2

In [28]:
df.iloc[1:3]

     height      long  d
b  0.479127  0.965552  2
c  0.025883  0.619999  2

**Lấy theo chiều thuộc tính**

In [29]:
df['long']

a    0.135409
b    0.965552
c    0.619999
Name: long, dtype: float64

In [30]:
df.long

a    0.135409
b    0.965552
c    0.619999
Name: long, dtype: float64

# 3. Phép toán trên DataFrame

In [31]:
df['height/long']=df['height']/df['long']
df

     height      long  d  height/long
a  0.376248  0.135409  2     2.778601
b  0.479127  0.965552  2     0.496220
c  0.025883  0.619999  2     0.041747

In [32]:
df.values

array([[0.37624811, 0.13540919, 2.        , 2.77860106],
       [0.47912656, 0.96555191, 2.        , 0.4962204 ],
       [0.02588329, 0.61999877, 2.        , 0.04174732]])

In [33]:
df.values[0]

array([0.37624811, 0.13540919, 2.        , 2.77860106])

In [34]:
df.T

                    a         b         c
height       0.376248  0.479127  0.025883
long         0.135409  0.965552  0.619999
d            2.000000  2.000000  2.000000
height/long  2.778601  0.496220  0.041747

**Phép cộng trên dữ liệu Series**

In [35]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

Ta thấy rằng có những chổ có index thiếu khi cộng sẽ hiện thị ra NaN(Not a Number).

In [36]:
4+np.nan

nan

**Phép cộng cho phép điền đầy giá trị bị khuyết trước khi cộng vào**

In [37]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

# 4. Xử lý dữ liệu bị khuyết

In [38]:
a=np.array([9,3,None,41])
a.dtype

dtype('O')

Do None là kiểu trong python lõi không có trong mảng khi chuyển qua mảng array sẽ hiểu là kiểu Object.

In [39]:
b=np.array([1,np.nan,3,4])
b.dtype

dtype('float64')

In [40]:
b.sum()

nan

In [41]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

**Tính giá trị bị khuyết**
## `isnull()` sẽ trả về mask kiểu boolean

In [42]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [43]:
data.isnull().sum()

2

## `notnull()`

In [44]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

**Xóa bỏ hàng có giá trị bị khuyết**
## `dropna()`

In [45]:
data.dropna()

0        1
2    hello
dtype: object

**Điền vào giá trị bị khuyết**
## `fillna()`

In [46]:
data.fillna(0)

0        1
1        0
2    hello
3        0
dtype: object

Phương thức method **'ffill'** có nghĩa là forward fill còn **'bfill'** là back fill.

In [47]:
data.fillna(method='ffill')

0        1
1        1
2    hello
3    hello
dtype: object

In [48]:
data.fillna(method='bfill')

0        1
1    hello
2    hello
3     None
dtype: object

**Kỹ thuật Split, apply, combine**

<img align="left" width="500" height="500" src="https://www.w3resource.com/w3r_images/pandas-groupby-split-apply-combine.svg">

## `DataFrame.groupby()`

In [49]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [50]:
df.groupby('key')

In [51]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

# 4. Xem một số thông tin cơ bản của DataFrame

**Đọc dữ liệu**
##  `pd.read_csv()`

In [52]:
data_frame=pd.read_csv('housing.csv')

In [53]:
type(data_frame)

pandas.core.frame.DataFrame

Ta thấy rằng file csv sẽ chuyển thành kiểu dataframe trong pandas.

**Xem dữ liệu đầu tiên và cuối**
## `DataFrame.head()` và `DataFrame.tail()`

In [54]:
data_frame.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [55]:
data_frame.shape

(20640, 10)

**Xem thông tin information dữ liệu cơ bản**

## `DataFrame.info()`

In [56]:
#Xem information số hàng,cột,dữ liệu rỗng, kiểu dữ liệu 
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  float64
 9   ocean_proximity     20640 non-null  object
dtypes: float64(9), object(1)
memory usage: 1.5+ MB

In [57]:
data_frame.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')

In [58]:
data_frame.index

RangeIndex(start=0, stop=20640, step=1)

**Sử dụng toán thổng kê để tính toán từ trường dữ liệu**
## `DataFrame.describe()`

In [59]:
data_frame.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

**Sort dữ liệu**
## `DataFrame.sort_values()`

In [60]:
data_frame['longitude'].sort_values(ascending=True)

2655    -124.35
1861    -124.30
1851    -124.30
2631    -124.27
2653    -124.26
          ...
12450   -114.56
2780    -114.55
12447   -114.49
13923   -114.47
13924   -114.31
Name: longitude, Length: 20640, dtype: float64

**Đếm giá trị dữ liệu**
## `DataFrame.value_counts()`

In [61]:
data_frame['housing_median_age'].value_counts()

52.0    1273
36.0     862
35.0     824
16.0     771
17.0     698
34.0     689
26.0     619
33.0     615
18.0     570
25.0     566
32.0     565
37.0     537
15.0     512
19.0     502
27.0     488
24.0     478
30.0     476
28.0     471
20.0     465
29.0     461
31.0     458
23.0     448
21.0     446
14.0     412
22.0     399
38.0     394
39.0     369
42.0     368
44.0     356
43.0     353
40.0     304
13.0     302
41.0     296
45.0     294
10.0     264
11.0     254
46.0     245
5.0      244
12.0     238
8.0      206
9.0      205
47.0     198
4.0      191
48.0     177
7.0      175
6.0      160
50.0     136
49.0     134
3.0       62
2.0       58
51.0      48
1.0        4
Name: housing_median_age, dtype: int64

**Tìm thõa điều kiện**

In [62]:
data_frame.loc[(data_frame.total_rooms>7000)]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
283,-122.16,37.79,22.0,12842.0,2048.0,4985.0,1967.0,5.9849,371000.0,NEAR BAY
508,-122.30,37.84,14.0,7355.0,2408.0,3100.0,2051.0,4.0018,143800.0,NEAR BAY
568,-122.24,37.73,21.0,7031.0,1249.0,2930.0,1235.0,4.5213,228400.0,NEAR BAY
570,-122.24,37.72,5.0,18634.0,2885.0,7427.0,2718.0,7.6110,350700.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20530,-121.76,38.57,11.0,15018.0,3008.0,7984.0,2962.0,3.1371,201800.0,INLAND
20539,-121.71,38.56,20.0,8627.0,1516.0,4071.0,1466.0,4.2198,164100.0,INLAND
20544,-121.76,38.55,23.0,8800.0,1857.0,6330.0,1832.0,2.0650,219400.0,INLAND
20563,-121.75,38.67,9.0,12139.0,2640.0,6837.0,2358.0,3.1250,132500.0,INLAND
20629,-121.39,39.12,28.0,10035.0,1856.0,6912.0,1818.0,2.0943,108300.0,INLAND

In [63]:
data_frame.loc[(data_frame.total_rooms>7000),['longitude','latitude','households']]

       longitude  latitude  households
1        -122.22     37.86      1138.0
283      -122.16     37.79      1967.0
508      -122.30     37.84      2051.0
568      -122.24     37.73      1235.0
570      -122.24     37.72      2718.0
...          ...       ...         ...
20530    -121.76     38.57      2962.0
20539    -121.71     38.56      1466.0
20544    -121.76     38.55      1832.0
20563    -121.75     38.67      2358.0
20629    -121.39     39.12      1818.0

[741 rows x 3 columns]

**Tìm index**

## `DataFrame.iloc[ ]`

In [64]:
data_frame.iloc[[9]]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
9,-122.25,37.84,52.0,3549.0,707.0,1551.0,714.0,3.6912,261100.0,NEAR BAY

In [65]:
data_frame.iloc[2:5]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [66]:
data_frame.iloc[2:5,-1]

2    NEAR BAY
3    NEAR BAY
4    NEAR BAY
Name: ocean_proximity, dtype: object